Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 300, 400, 1)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 300, 400, 32)      320       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 300, 400, 32)      9248      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 150, 200, 32)      0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 150, 200, 32)      9248      
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 150, 200, 32)      9248      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 75, 100, 32)       0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 75, 100, 32)       9248      
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 75, 100, 32)       9248      
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 37, 50, 32)        0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 37, 50, 32)        9248      
_________________________________________________________________
rpn_out_class (Conv2D)       (None, 37, 50, 6)         198       
=================================================================
Total params: 56,006
Trainable params: 56,006
Non-trainable params: 0
_________________________________________________________________
